/* 
  Localizable.strings
  MergeX

  Created by sylenthwave  on 2021/10/6.
  
*/

//MARK: - Home

"Sunday" = "Sunday";
"Monday" = "Monday";
"Tuesday" = "Tuesday";
"Wednesday" = "Wednesday";
"Thursday" = "Thursday";
"Friday" = "Friday";
"Saturday" = "Saturday";

"15 minutes" = "15 minutes";
"30 minutes" = "30 minutes";
"1 hour" = "1 hour";

/// - home nav title
"Today" = "Today";
"MMMM d" = "MMMM d";
"EEEE, MMMM d, yyyy" = "MMMM d, yyyy";
"MMMM d, yyyy" = "MMMM d, yyyy";
"MMM d" = "MMM d";
"MMM, yyyy" = "MMM, yyyy";
"yyyy" = "yyyy ";

"Su" = "Su";
"Mo" = "Mo";
"Tu" = "Tu";
"We" = "We";
"Th" = "Th";
"Fr" = "Fr";
"Sa" = "Sa";

"Week %d" = "Week %d";
"Tasks" = "Tasks";
"Notes" = "Notes";
"%d notes" = "%d notes";

"No Tasks" = "No tasks";
"Tap + button to create a new task" = "Tap + button to create a new task";

"No Note Lists" = "No note lists";
"Tap + button to create a new note list" = "Tap + button to create a new note list";

"No Task Lists" = "No task lists";
"Tap + button to create a new task list" = "Tap + button to create a new task list";

"No Tags" = "No tags";
"Tap + button to create a new tag" = "Tap + button to create a new tag";

"No Task Records" = "No Task Records";


"Count" = "Count";
"Durtion" = "Durtion";
"rainbow_focus_times" = "";
"rainbow_focus_hours" = "";

"Focus by %@" =  "Focus by %@";
"Inbox" = "Inbox";
"Lists" = "Lists";
"Number of tasks" = "Tasks";
"Number of lists" = "Lists";
"All lists" = "All Lists";
"Number of notes" = "Notes";
"Calendar" = "Calendar";
"List Tasks" = "List Tasks";
"Notes" = "Notes";
"Notes List" = "Notes List";
"All Notes" = "All Notes";
"全部笔记" = "All Notes";
"New Note" = "New Note";
"Recently" = "Recently";
"Recently Edit" = "Recently Edited";
"All Tags" = "All Tags";

"Weekly durtion" = "Total weekly";
"Daily durtion" = "Daily average";
"h" = "h";
"m" = "m";
"s" = "s";
"Task Duration from %@ to %@" = "Task Duration from %@ to %@";

"MergeX" = "MergeX";
"Tags" = "Tags";
"Tag" = "Tag";
"Note Lists" = "Note Lists";
"Task Lists" = "Task Lists";
"Rainbow Focus" = "Rainbow Focus";
"Task Records" = "Task Records";
"Settings" = "Settings";
"Trash" = "Trash";
"Modules" = "Moudles";
"Others" = "Others";

"Quickly Access" = "Quick Access";

"Today's Focus" = "Today's Focus";
"Today's Focus Hours" = "Today's Focus Hours";
"Today's Focus Times" = "Today's Focus Times";

"Start focus" = "Start focus";
"Week's Focused" = "Week's Focused";
"focused hours" = "focused hours";

"Cancel" = "Cancel";
"Done" = "Done";

"Open Quickly" = "Open Quickly";
"Quickly switch between modules to search for tasks, lists, notes, note lists and tags" = "Quickly switch between modules to search for tasks, lists, notes, note lists and tags";

"Timing" = "Timing";
"Countdown" = "Countdown";
"Start timing focus" = "Start timing focus";
"Start countdown focus" = "Start countdown focus";
"Continue" = "Continue";
"Pause" = "Pause";
"End" = "End";
"%d m" = "%d m";
"%d h" = "%d h";
"%dh %dm" = "%dh %dm";

"Focus" = "Focus";
"Week" = "Week";
"Year" = "Year";

"Focus Durtion" = "Focus Durtion";
"Focus Times" = "Focus Times";
"Daily Duration" = "Daily Duration";
"Daily Focus Durtion" = "Daily Focus Durtion";
"Daily Times" = "Daily Times";
"Daily Focus Times" = "Daily Focus Times";

"Focus on categories" = "Focus on categories";
"Total Focus Duration" = "Total Focus Duration";
"Total Focus Times" = "Total Focus Times";
"Weekly focused record" = "Weekly focused record";
"Week %d Focus Record" = "Week %d Focus Record";

"count_num" = "";
"day_num" = "";
"line_num" = "";


"Total Duration" = "Total Duration";
"Daily Duration" = "Daily Duration";
"Completion" = "Completion";
"Unstart" = "Unstart";

"Total task duration" = "Total task duration";
"Total annual tasks" = "Total annual tasks";
"Total assignment days" = "Total assignment days";
"Ranking of category tag hours (top three)" = "Ranking of category tag hours (top three)";
"Weekly Record" = "Weekly Record";

"Total number" = "Total count";
"Total days" = "Total days";


"Edit Note List" = "Edit note list";
"New Note List" = "New note list";
"Icon:" = "Icon:";
"Name:" = "Name:";

"Edit Task List" = "Edit Task List";
"New Task List" = "New task list";

"Edit Tag" = "Edit tag";
"New Tag" = "New tag";
"Icon And Title" = "Icon and title";
"Color" = "Color";

"Date" = "Date";
"Edit" = "Edit";
"Move" = "Move";
"Delete" = "Delete";
"Top" = "Top";
"Untop" = "Untop";
"Restore" = "Restore" ;
"Add" = "Add";

/// - Task List
"min" = "min";
"hour" = "hour";
"hours" = "hours";
"Start Time" = "Start Time";
"Duration" = "Duration";
"Setup Date" = "Set date";
"Setup Tag" = "Set tag";
"New Tag" = "New tag";
"Add+" = "Add+";
"New To-Do" = "New To-Do";
"Setup Tags" = "Set Tags";
"New+" = "New+";


/// - Task Note 
"Time" = "Time";
"Timing" = "Timing";
"Timingkeep" = "Timing";
"Time Periods" = "Time Periods";
"Only one timed task creation is supported" = "Only one timed task creation is supported";
"If you want to create a new timed task, please first end the task you are currently performing" = "If you want to create a new timed task, please first end the task you are currently performing";
"Got it" = "Got it";

"Note Title" = "Note title";

"Clear Date" = "Clear date";
"End Repeat" = "End repeat";
"Repeat" = "Repeat";
"On Date" = "On date";
"Never" = "Never";
"None" = "None";
"Daily" = "Daily";
"Weekly" = "Weekly";
"Monthly" = "Monthly";
"Yearly" = "Yearly" ;

"Anytime" = "Anytime";
"Repeat End Date" = "Repeat End Date";
"End Date" = "End date";
"minutes" = "minutes";

"Focus Sound" = "Focus Sound";
"Clock" = "Clock";
"Rain" = "Rain";
"Forest" = "Forest";
"Waves" = "Waves";
"River" = "River";
"Fires" = "Fires";
"Birdsong" = "Birdsong";
"Insects chirping" = "Insects chirping";


"Add to note lists" = "Add to note lists";
"Add to task lists" = "Add to task lists";

"Create Time Period Task" = "Time period task";
"Create Timed Tasks" = "Timed task";
"Select Task" = "Select task";
"Archived Tasks" = "Archived tasks";
"Configure Plugin" = "Configure plugin";
"Sort By Creation Time" = "Sort by creation time";
"Sort By Update Time" = "Sort by update time";
"Insert Code Snippet" = "Insert code snippet";
"Insert Link" = "Insert link";
"Insert File"  = "Insert file";
"Insert Subpage" = "Insert Subpage";


/// - Note Actions
"Camera" = "Camera";
"Photo Library" = "Photo Library";
"Recognition" = "Recognition";
"Scanning" = "Scanning";
"File" = "File";
"Drawing" = "Drawing";
"Code Snippe" = "Code snippe";
"Subpage" = "Subpage";

"Title" = "Title";
"Subtitle" = "Subtitle";
"Heading" = "Heading";
"Strong" = "Strong";
"Body" = "Body";
"Increase" = "Increase";
"Decrease" = "Decrease";
"Indentation" = "Indentation";

"Quote" = "Quote";

"Checkmark List" = "Checkmark";
"Dot List" = "Dot";
"Number List" = "Number";

"Checkmark list" = "Checkmark list";
"Dot list" = "Dot list";
"Number list" = "Number list";

"Italic" = "Italic";
"Underlink" = "Underlink";
"Striketthrough" = "Striketthrough";
"Alignleft" = "Alignleft";
"Aligncenter" = "Aligncenter";
"Alignright" = "Alignright";
"Dashed line" = "Dash";
"Line" = "Normal";
"Dot Line" = "Dot";
"Code Snippe" = "Code snippe";
"InlineCode" = "InlineCode";
"Restore" = "Restore";

"Style" = "Style";
"Copy" = "Copy";
"Cut" = "Cut";
"Group Images" = "Group";
"Layout Images" = "Layout";
"Ungroup Images" = "Ungroup";
"Paste" = "Paste";

"Heading Style" = "Heading Style";
"List Style" = "List Style";
"Align Style" = "Align Style";
"Line Style" = "Line Style";
"Text Style" = "Text Style";
"Insert..." = "Insert...";

"Focus Settings" = "Focus Settings";
"Export" = "Export";
"More" = "More";

"Update Time" = "Update time";
"Creation Time" = "Creation time";
"Character Count" = "Characters";
"Paragraphs" = "Paragraphs";
"Txt" = "Txt";

"Sound On" = "Sound On";
"Screen Always On" = "Screen Always On";


/// - Prompt
"‼️ The %@ plugin has been removed" = "‼️ The %@ plugin has been removed";
"🌟 Has used the %@ plugin" = "🌟 Has used the %@ plugin";
"Deleted %d tasks" = "Deleted %d tasks";
"🌟 Has restored %d tasks" =  "🌟 Has restored %d tasks";
"🌟 Has remade the home page plugin order" = "🌟 Has remade the home page plugin order";

"Plugin Sort" = "Plugin Sort";
"Sort" = "Sort";

"Tasks added to" = "Tasks added to";

/// - Alerts
"The current task is repeating task, should it be deleted" = "The current task is repeat task, should it be deleted";
"Delete this occurrence" = "Delete this occurrence";
"Delete current and future" = "Delete current and future";
"Delete all" =  "Delete all";

"Whether to delete the selected tasks" = "Whether to delete the selected tasks";
"Whether to delete the selected task lists" = "Whether to delete the selected task lists";
"Whether to delete the selected note lists" = "Whether to delete the selected note lists";
"Whether to delete the selected tags" = "Whether to delete the selected tags";



"Focusing time less than one minute will not be recorded, whether to quit focusing" = "Focusing time less than one minute will not be recorded, whether to quit focusing";

"The current tag is the default tag, do you select a tag?" = "The current tag is the default tag, do you select a tag?";

"Whether to cancel the %@ plug-in" = "Whether to cancel the %@ plug-in";
"After canceling the use of the plug-in home quick plug-in area will not display this plug-in" = "After canceling the use of the plug-in home quick plug-in area will not display this plug-in";

"Continue current timing task?" = "Continue current timing task?";
"Pause current timing task?" = "Pause current timing task?";
"End current timing task?" = "End current timing task?";

"Invalid link" = "Invalid link";

"Update Title" = "Update Title";

"Enter link name" = "Enter link name";

"Whether to delete the current note" = "Whether to delete the current notes";

"Whether to discard change" = "Whether to discard change";
"Discard" = "Discard";
"Continue" = "Continue";

"Whether to add the selected %d tasks to the inbox" = "Whether to add the selected %d tasks to the inbox";

"Archived" = "Archived";
"Clear" = "Clear";

// Menu
"Time Or Date" = "Time Or Date         ";
"Mark As Completed" = "Mark As Completed";
"Mark As Canceled" = "Mark As Canceled";
"Set Tags" = "Set Tags";
"Complete" = "Complete";
"Open In New Window" = "Open In New Window";
"Add To Note Lists" = "Add To Note Lists";
"Add To Task Lists" = "Add to Task Lists";
"Add To" = "Add To";
"Operations" = "Operations";

"Pin To Top" = "Pin To Top                    ";
"Unpin" = "Unpin";
"Move To Note Lists" = "Move To Note Lists";

"Edit Task List" = "Edit Task List";
"Edit Note List" = "Edit Note List";

"Undo" = "Undo";
"Redo" = "Redo";
"Close Window" = "Close Window";
"Format" = "Format";
"Restore List" = "Restore List";

/// - Settings for iOS
"Theme" = "Theme";
"Badge Count" = "Badge Count";
"Sound" = "Sound";

"Module Sort" = "Module Sort";
"Plugin Sort" = "Plugin Sort";

"Start Week On" = "Start Week On";
"New Task Timeinterval" = "Task Timeinterval";

"iCloud Sync" = "iCloud Sync";
"Create Tutorial Project" = "Create Tutorial Project";

"Contact Us" =  "Contact Us";
"Rate Us" = "Rate us";
"Share To Friends" = "Share To Friends";

"About" = "About";
"About MergeX" = "About MergeX";

"General" = "General";

"Modules And Plugins" =  "Modules And Plugins";

"Time And Date" = "Time And Date";

"Data Settings" = "Data";

"Help & Feedback" = "Help & Feedback";

"On" = "On";
"Off" = "Off";

"Completed %@, remaining: %@" = "Completed %@, remaining: %@";

"Note Lists Pulgin" = "Note Lists Pulgin";
"Task Lists Pulgin" = "Task Lists Pulgin";
"Rainbow Focus Pulgin" = "Rainbow Focus Pulgin";
"Task Records Pulgin" = "Task Records Pulgin";

/// - Theme
"Classic" = "Classic";
"Darkness" = "Darkness";
"Distortion" = "Distortion";
"Madison" = "Madison";
"Deeply" = "Deeply";
"Sunrise" = "Sunrise";
"Gruvbox" = "Gruvbox";

"Change Logo" = "Change Logo";
"Logo" = "Logo";
